Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
filter:
The element filter.   All references will belong to elements passing this filter.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements.
targetElementIds:
The target element ids.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from a single target element only.
targetElementId:
The target element id.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Returns true if the view is not a view template.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013